nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w6_matrix.c
    ++g_r2_w6_result.input_count;
    ++g_r2_w6_result.admitted_count;
    ++g_r2_w6_result.admitted_by_buffer[descriptor.buffer_id];

    if (g_r2_w6_result.current_drop_streak != 0U)
    {
        ++g_r2_w6_result.recovered_admission_after_drop_count;
        g_r2_w6_result.current_drop_streak = 0U;
    }

    if (trace->nominal_to_decision_cycles >
        g_r2_w6_result.max_nominal_to_decision_cycles)
    {
        g_r2_w6_result.max_nominal_to_decision_cycles =
            trace->nominal_to_decision_cycles;
    }
    if (trace->final_window_cycles >
        g_r2_w6_result.max_final_window_cycles)
    {
        g_r2_w6_result.max_final_window_cycles =
            trace->final_window_cycles;
    }

    if ((R2_BufferPool_GetSnapshot(&ownership_after) != R2_BUFFER_POOL_OK) ||
        (ownership_after.states[mapping_after.m0_buffer] !=
            R2_BUFFER_STATE_DMA_OWNED) ||
        (ownership_after.states[mapping_after.m1_buffer] !=
            R2_BUFFER_STATE_DMA_OWNED) ||
        (ownership_after.violation_count != 0U) ||
        (mapping_after.violation_count != 0U))
    {
        LatchFault(R2_W6_FAULT_MODEL);
        return;
    }

    if (sequence == R2_W6_EVENTS)
    {
        g_r2_w6_result.phase = R2_W6_QUIESCING;
        CLEAR_BIT(TIM2->CR1, TIM_CR1_CEN);
        __DSB();
    }
}

static void M0Complete(DMA_HandleTypeDef *dma)
{
    Completed(dma, 0U);
}

static void M1Complete(DMA_HandleTypeDef *dma)
{
    Completed(dma, 1U);
}

static void DmaError(DMA_HandleTypeDef *dma)
{
    (void)dma;
    LatchFault(R2_W6_FAULT_DMA);
}

void R2_W6_IrqExit(void)
{
    uint32_t now = DWT->CYCCNT;
    uint32_t offset = now - g_r2_w6_result.epoch_before;

    if (trace_for_exit < R2_W6_EVENTS)
    {
        volatile R2_W6_Trace *trace = &g_r2_w6_result.trace[trace_for_exit];
        uint32_t nominal = trace->sequence * R2_W6_BLOCK_CYCLES;

        if (offset < nominal)
        {
            LatchFault(R2_W6_FAULT_TIMING);
        }
        else
        {
            trace->nominal_to_irq_exit_cycles = offset - nominal;
            if (trace->nominal_to_irq_exit_cycles > R2_W6_EXIT_LIMIT_CYCLES)
            {
                LatchFault(R2_W6_FAULT_TIMING);
            }
            if (trace->nominal_to_irq_exit_cycles >
                g_r2_w6_result.max_nominal_to_irq_exit_cycles)
            {
                g_r2_w6_result.max_nominal_to_irq_exit_cycles =
                    trace->nominal_to_irq_exit_cycles;
            }
        }
    }

    if (irq_should_yield != pdFALSE)
    {
        portYIELD_FROM_ISR(pdTRUE);
    }
}

static int ConfigurationValid(void)
{
    uint32_t id;

    if ((SystemCoreClock != 180000000U) ||
        (HAL_RCC_GetPCLK1Freq() != 45000000U) ||
        (HAL_RCC_GetPCLK2Freq() != 90000000U) ||
        (HAL_NVIC_GetPriorityGrouping() != NVIC_PRIORITYGROUP_4) ||
        (hadc1.Instance != ADC1) ||
        (htim2.Instance != TIM2) ||
        (hdma_adc1.Instance != DMA2_Stream0) ||
        (hadc1.DMA_Handle != &hdma_adc1) ||
        (hdma_adc1.State != HAL_DMA_STATE_READY) ||
        ((DMA2_Stream0->CR & DMA_SxCR_EN) != 0U) ||
        ((TIM2->CR1 & TIM_CR1_CEN) != 0U) ||
        (TIM2->PSC != 0U) ||
        (TIM2->ARR != 449U) ||
        ((TIM2->CR2 & TIM_CR2_MMS) != TIM_TRGO_UPDATE) ||
        (TIM2->DIER != 0U) ||
        (hadc1.Init.ClockPrescaler != ADC_CLOCK_SYNC_PCLK_DIV4) ||
        (hadc1.Init.Resolution != ADC_RESOLUTION_12B) ||
        (hadc1.Init.ContinuousConvMode != DISABLE) ||
        (hadc1.Init.DMAContinuousRequests != ENABLE) ||
        (hadc1.Init.ExternalTrigConv != ADC_EXTERNALTRIGCONV_T2_TRGO) ||
        (hadc1.Init.ExternalTrigConvEdge != ADC_EXTERNALTRIGCONVEDGE_RISING) ||
        ((ADC1->CR1 & (ADC_CR1_EOCIE | ADC_CR1_OVRIE)) != 0U) ||
        (ADC1->SQR1 != 0U) ||
        (ADC1->SQR3 != 0U) ||
        ((ADC1->SMPR2 & ADC_SMPR2_SMP0) != ADC_SAMPLETIME_28CYCLES) ||
        (NVIC_GetPriority(DMA2_Stream0_IRQn) != 5U))
    {
        return 0;
    }

    for (id = 0U; id < R2_W6_BUFFERS; ++id)
    {
        uint32_t address = Address(id);
        if (((address & 3U) != 0U) ||
            (address < 0x20000000U) ||
            (address > 0x20020000U - 2U * R2_W6_BLOCK_SAMPLES))
        {
            return 0;
        }
    }

    return 1;
}

static HAL_StatusTypeDef Start(void)
{
    HAL_StatusTypeDef status;
    uint32_t primask;

    (void)HAL_TIM_Base_Stop(&htim2);
    __HAL_TIM_SET_COUNTER(&htim2, 0U);
    __HAL_TIM_CLEAR_FLAG(&htim2, TIM_FLAG_UPDATE);
    CLEAR_BIT(DMA2_Stream0->CR, DMA_SxCR_DBM | DMA_SxCR_CT);
    DisableDmaInterrupts();
    DMA2->LIFCR = W6_ALL_FLAGS;
    HAL_NVIC_ClearPendingIRQ(DMA2_Stream0_IRQn);

    hdma_adc1.XferCpltCallback = M0Complete;
    hdma_adc1.XferM1CpltCallback = M1Complete;
    hdma_adc1.XferHalfCpltCallback = NULL;
    hdma_adc1.XferM1HalfCpltCallback = NULL;
    hdma_adc1.XferErrorCallback = DmaError;
    hdma_adc1.XferAbortCallback = NULL;

    status = HAL_DMAEx_MultiBufferStart_IT(
        &hdma_adc1,
        (uint32_t)(uintptr_t)&ADC1->DR,
        Address(0U),
        Address(1U),
        R2_W6_BLOCK_SAMPLES);
    if (status != HAL_OK)
    {
        return status;
    }

    __HAL_DMA_DISABLE_IT(&hdma_adc1, DMA_IT_HT);
    __HAL_ADC_CLEAR_FLAG(&hadc1, ADC_FLAG_EOC | ADC_FLAG_OVR);

    status = HAL_ADC_Start(&hadc1);
    if (status != HAL_OK)
    {
        return status;
    }

    SET_BIT(ADC1->CR2, ADC_CR2_DMA);

    g_r2_w6_result.start_dma_cr = DMA2_Stream0->CR;
    g_r2_w6_result.start_dma_ndtr = DMA2_Stream0->NDTR;
    g_r2_w6_result.start_adc_cr2 = ADC1->CR2;
    g_r2_w6_result.start_tim2_cr1 = TIM2->CR1;

    if ((DMA2_Stream0->CR != W6_DMA_REQUIRED_CR) ||
        (DMA2_Stream0->NDTR != R2_W6_BLOCK_SAMPLES) ||
        (DMA2_Stream0->M0AR != Address(0U)) ||
        (DMA2_Stream0->M1AR != Address(1U)) ||
        (ADC1->CR2 != W6_ADC_REQUIRED_CR2) ||
        ((TIM2->CR1 & TIM_CR1_CEN) != 0U))
    {
        return HAL_ERROR;
    }

    g_r2_w6_result.phase = R2_W6_ARMED;
    primask = __get_PRIMASK();
    __disable_irq();
    g_r2_w6_result.phase = R2_W6_RUNNING;
    g_r2_w6_result.epoch_before = DWT->CYCCNT;
    status = HAL_TIM_Base_Start(&htim2);
    __DSB();
    g_r2_w6_result.epoch_after = DWT->CYCCNT;
    __set_PRIMASK(primask);

