nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w6_matrix.c
    return status;
}

static HAL_StatusTypeDef Stop(void)
{
    uint32_t begin;
    HAL_StatusTypeDef status;

    g_r2_w6_result.phase = R2_W6_QUIESCING;
    (void)HAL_TIM_Base_Stop(&htim2);
    DisableDmaInterrupts();

    begin = DWT->CYCCNT;
    while ((uint32_t)(DWT->CYCCNT - begin) < W6_SETTLE_CYCLES)
    {
        __NOP();
    }

    g_r2_w6_result.dma_error_flags_seen |= DMA2->LISR & W6_DMA_ERRORS;
    g_r2_w6_result.adc_ovr_seen |= ADC1->SR & ADC_SR_OVR;

    status = HAL_ADC_Stop_DMA(&hadc1);
    DMA2->LIFCR = W6_ALL_FLAGS;
    HAL_NVIC_ClearPendingIRQ(DMA2_Stream0_IRQn);
    __DSB();

    if ((DMA2_Stream0->CR & DMA_SxCR_EN) != 0U)
    {
        return HAL_ERROR;
    }

    return status;
}

static void ProcessDescriptor(const W6_BlockDescriptor *descriptor)
{
    uint32_t id = descriptor->buffer_id;
    uint32_t sequence = descriptor->sequence;
    uint32_t bit;
#if R2_W6_DROP_MODE != 0U
    uint32_t begin;
#endif
    uint32_t min_value = UINT32_MAX;
    uint32_t max_value = 0U;
    uint32_t j;
    R2_BufferState state;
    volatile R2_W6_Trace *trace;

    if ((sequence == 0U) ||
        (sequence > R2_W6_EVENTS) ||
        (id >= R2_W6_BUFFERS))
    {
        LatchFault(R2_W6_FAULT_PROCESSING);
        return;
    }

    trace = &g_r2_w6_result.trace[sequence - 1U];
    if ((trace->decision != R2_W6_DECISION_ADMIT) ||
        (trace->completed_id != id) ||
        (descriptor->mapping_epoch != trace->mapping_epoch_after))
    {
        LatchFault(R2_W6_FAULT_PROCESSING);
        return;
    }

    bit = BitFor((R2_BufferId)id);

    taskENTER_CRITICAL();
    if (((ready_token_mask & bit) == 0U) ||
        (R2_BufferPool_GetState((R2_BufferId)id, &state) !=
            R2_BUFFER_POOL_OK) ||
        (state != R2_BUFFER_STATE_READY) ||
        (R2_BufferPool_ClaimReady((R2_BufferId)id) != R2_BUFFER_POOL_OK))
    {
        taskEXIT_CRITICAL();
        LatchFault(R2_W6_FAULT_PROCESSING);
        return;
    }
    ready_token_mask &= ~bit;
    taskEXIT_CRITICAL();

    trace->processing_begin_offset_cycles =
        DWT->CYCCNT - g_r2_w6_result.epoch_before;

    /* NORMAL mode performs no deliberate hold. DROP mode holds the current
     * PROCESSING buffer for K+5 block periods so all K FREE tokens are
     * consumed and several consecutive capacity drops are forced. The task
     * remains preemptible by DMA and kernel interrupts in both modes. */
#if R2_W6_DROP_MODE != 0U
    begin = DWT->CYCCNT;
    while ((uint32_t)(DWT->CYCCNT - begin) < R2_W6_PROCESS_HOLD_CYCLES)
    {
        __NOP();
    }
#endif

    if ((buffers[id].guard_lo != W6_GUARD_LO) ||
        (buffers[id].guard_hi != W6_GUARD_HI))
    {
        ++g_r2_w6_result.canary_errors;
        LatchFault(R2_W6_FAULT_SAMPLES);
        return;
    }

    for (j = 0U; j < R2_W6_BLOCK_SAMPLES; ++j)
    {
        uint32_t value = buffers[id].samples[j];
        if (value > 4095U)
        {
            ++g_r2_w6_result.sample_errors;
        }
        else
        {
            ++g_r2_w6_result.full_sample_count;
        }
        if (value < min_value)
        {
            min_value = value;
        }
        if (value > max_value)
        {
            max_value = value;
        }
    }

    trace->raw_min = min_value;
    trace->raw_max = max_value;
    trace->processing_end_offset_cycles =
        DWT->CYCCNT - g_r2_w6_result.epoch_before;

    if (g_r2_w6_result.sample_errors != 0U)
    {
        LatchFault(R2_W6_FAULT_SAMPLES);
        return;
    }

    if (SendFreeToken(W6_FREE_SEND_COMPLETE,
            (R2_BufferId)id, sequence) != pdPASS)
    {
        LatchFault(R2_W6_FAULT_RELEASE);
        return;
    }

    ++g_r2_w6_result.processed_count;
    ++g_r2_w6_result.released_count;
    ++g_r2_w6_result.processed_by_buffer[id];
    ++g_r2_w6_result.released_by_buffer[id];
    trace->processed_ok = 1U;
}

static void ProcessingTask(void *argument)
{
    uint32_t notification_value;
    W6_BlockDescriptor descriptor;
    (void)argument;

    for (;;)
    {
        notification_value = 0U;
        (void)xTaskNotifyWait(0U, UINT32_MAX,
            &notification_value, portMAX_DELAY);

        if ((notification_value & W6_WORK_BIT) != 0U)
        {
            while (xQueueReceive(ready_queue, &descriptor, 0U) == pdPASS)
            {
                ProcessDescriptor(&descriptor);
                if (g_r2_w6_result.fault_bits != 0U)
                {
                    break;
                }
            }
        }
    }
}

static void Finalize(void)
{
    R2_BufferPoolSnapshot pool;
    R2_DmaSlotsSnapshot slots;
    uint32_t expected_free_mask = 0U;
    uint32_t dropped_sum = 0U;
    uint32_t id;

    if ((R2_BufferPool_GetSnapshot(&pool) != R2_BUFFER_POOL_OK) ||
        (R2_DmaSlots_GetSnapshot(&slots) != R2_DMA_SLOTS_OK))
    {
        LatchFault(R2_W6_FAULT_MODEL);
        return;
    }

    g_r2_w6_result.pool_at_stop = pool;
    g_r2_w6_result.slots_at_stop = slots;
    g_r2_w6_result.free_queue_depth_final =
        (uint32_t)uxQueueMessagesWaiting(free_queue);
    g_r2_w6_result.ready_queue_depth_final =
        (uint32_t)uxQueueMessagesWaiting(ready_queue);
    g_r2_w6_result.free_token_mask_final = free_token_mask;
    g_r2_w6_result.ready_token_mask_final = ready_token_mask;

    for (id = 0U; id < R2_W6_BUFFERS; ++id)
    {
        if ((buffers[id].guard_lo != W6_GUARD_LO) ||
            (buffers[id].guard_hi != W6_GUARD_HI))
        {
            ++g_r2_w6_result.canary_errors;
        }

        if (pool.states[id] == R2_BUFFER_STATE_FREE)
        {
            expected_free_mask |= 1UL << id;
        }

        if ((g_r2_w6_result.admitted_by_buffer[id] !=
                g_r2_w6_result.processed_by_buffer[id]) ||
            (g_r2_w6_result.admitted_by_buffer[id] !=
                g_r2_w6_result.released_by_buffer[id]))
        {
            LatchFault(R2_W6_FAULT_PROCESSING);
        }

        dropped_sum += g_r2_w6_result.dropped_by_buffer[id];
    }

    if ((pool.k != R2_W6_K) ||
        (pool.active_count != R2_W6_BUFFERS) ||
        (pool.free_count != R2_W6_K) ||
        (pool.ready_count != 0U) ||
        (pool.processing_count != 0U) ||
        (pool.dma_owned_count != 2U) ||
        (pool.violation_count != 0U) ||
        (slots.violation_count != 0U) ||
        (slots.m0_buffer == slots.m1_buffer) ||
        (pool.states[slots.m0_buffer] != R2_BUFFER_STATE_DMA_OWNED) ||
        (pool.states[slots.m1_buffer] != R2_BUFFER_STATE_DMA_OWNED) ||
        (g_r2_w6_result.free_queue_depth_final != R2_W6_K) ||
        (g_r2_w6_result.ready_queue_depth_final != 0U) ||
        (ready_token_mask != 0U) ||
        (free_token_mask != expected_free_mask) ||
        ((free_token_mask | BitFor(slots.m0_buffer) |
          BitFor(slots.m1_buffer)) != W6_ALL_BUFFER_MASK))
    {
        LatchFault(R2_W6_FAULT_MODEL);
    }

    if ((g_r2_w6_result.input_count != R2_W6_EVENTS) ||
        ((g_r2_w6_result.admitted_count +
          g_r2_w6_result.capacity_drop_count) != R2_W6_EVENTS) ||
        (g_r2_w6_result.processed_count != g_r2_w6_result.admitted_count) ||
        (g_r2_w6_result.released_count != g_r2_w6_result.admitted_count) ||
        (g_r2_w6_result.completion_hook_count != g_r2_w6_result.admitted_count) ||
        (g_r2_w6_result.init_hook_count != R2_W6_K) ||
        (g_r2_w6_result.illegal_free_send_count != 0U) ||
        (g_r2_w6_result.ready_send_fail_count != 0U) ||
        (g_r2_w6_result.notification_fail_count != 0U) ||
        (g_r2_w6_result.token_ledger_errors != 0U) ||
        (g_r2_w6_result.dma_error_flags_seen != 0U) ||
        (g_r2_w6_result.adc_ovr_seen != 0U) ||
        (g_r2_w6_result.full_sample_count !=
            g_r2_w6_result.admitted_count * R2_W6_BLOCK_SAMPLES) ||
        (g_r2_w6_result.sample_errors != 0U) ||
        (g_r2_w6_result.canary_errors != 0U) ||
        (dropped_sum != g_r2_w6_result.capacity_drop_count))
    {
        LatchFault(R2_W6_FAULT_EVENT);
    }

