nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w6_matrix.c
    if (R2_W6_DROP_MODE == 0U)
    {
        if ((g_r2_w6_result.admitted_count != R2_W6_EVENTS) ||
            (g_r2_w6_result.capacity_drop_count != 0U) ||
            (g_r2_w6_result.max_drop_streak != 0U) ||
            (g_r2_w6_result.recovered_admission_after_drop_count != 0U))
        {
            LatchFault(R2_W6_FAULT_EVENT);
        }
    }
    else
    {
        if ((g_r2_w6_result.admitted_count < R2_W6_MIN_ADMISSIONS) ||
            (g_r2_w6_result.capacity_drop_count < R2_W6_MIN_CAPACITY_DROPS) ||
            (g_r2_w6_result.max_drop_streak < R2_W6_MIN_DROP_STREAK) ||
            (g_r2_w6_result.recovered_admission_after_drop_count <
                R2_W6_MIN_RECOVERIES))
        {
            LatchFault(R2_W6_FAULT_EVENT);
        }
    }
}

static void ControlTask(void *argument)
{
    uint32_t id;
    uint32_t j;
    TickType_t start_tick;
    TickType_t drain_tick;
    HAL_StatusTypeDef status;
    (void)argument;

    vTaskDelay(pdMS_TO_TICKS(100U));

    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    g_r2_w6_result.system_core_clock = SystemCoreClock;
    g_r2_w6_result.configured_k = R2_W6_K;
    g_r2_w6_result.drop_mode = R2_W6_DROP_MODE;
    g_r2_w6_result.process_hold_blocks = R2_W6_PROCESS_HOLD_BLOCKS;
    g_r2_w6_result.aircr = SCB->AIRCR;
    g_r2_w6_result.min_free_depth = R2_W6_K;

    for (id = 0U; id < R2_W6_BUFFERS; ++id)
    {
        buffers[id].guard_lo = W6_GUARD_LO;
        buffers[id].guard_hi = W6_GUARD_HI;
        for (j = 0U; j < R2_W6_BLOCK_SAMPLES; ++j)
        {
            buffers[id].samples[j] = W6_SENTINEL;
        }
        g_r2_w6_result.buffer_address[id] = Address(id);
    }

    if (!ConfigurationValid())
    {
        LatchFault(R2_W6_FAULT_CONFIG);
        g_r2_w6_result.phase = R2_W6_FAILED;
    }
    else
    {
        status = Start();
        g_r2_w6_result.start_status = (uint32_t)status;
        if (status != HAL_OK)
        {
            LatchFault(R2_W6_FAULT_START);
        }

        start_tick = xTaskGetTickCount();
        while (g_r2_w6_result.phase == R2_W6_RUNNING)
        {
            if ((TickType_t)(xTaskGetTickCount() - start_tick) >=
                pdMS_TO_TICKS(W6_RUN_TIMEOUT_MS))
            {
                LatchFault(R2_W6_FAULT_TIMEOUT);
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(1U));
        }

        status = Stop();
        g_r2_w6_result.stop_status = (uint32_t)status;
        if ((status != HAL_OK) ||
            ((DMA2_Stream0->CR & DMA_SxCR_EN) != 0U) ||
            ((TIM2->CR1 & TIM_CR1_CEN) != 0U) ||
            ((ADC1->CR2 & (ADC_CR2_ADON | ADC_CR2_DMA)) != 0U))
        {
            LatchFault(R2_W6_FAULT_STOP);
        }

        drain_tick = xTaskGetTickCount();
        while ((g_r2_w6_result.processed_count !=
                g_r2_w6_result.admitted_count) &&
               (g_r2_w6_result.fault_bits == 0U))
        {
            if ((TickType_t)(xTaskGetTickCount() - drain_tick) >=
                pdMS_TO_TICKS(W6_DRAIN_TIMEOUT_MS))
            {
                LatchFault(R2_W6_FAULT_TIMEOUT);
                break;
            }
            (void)xTaskNotify(processing_task_handle,
                W6_WORK_BIT, eSetBits);
            vTaskDelay(pdMS_TO_TICKS(1U));
        }

        if (g_r2_w6_result.fault_bits == 0U)
        {
            uint32_t irq_before = g_r2_w6_result.irq_count;
            uint32_t input_before = g_r2_w6_result.input_count;
            uint32_t admitted_before = g_r2_w6_result.admitted_count;
            uint32_t drop_before = g_r2_w6_result.capacity_drop_count;
            uint32_t processed_before = g_r2_w6_result.processed_count;

            vTaskDelay(pdMS_TO_TICKS(2U));

            g_r2_w6_result.quiet_irq_count = g_r2_w6_result.irq_count;
            g_r2_w6_result.quiet_input_count = g_r2_w6_result.input_count;
            g_r2_w6_result.quiet_admitted_count =
                g_r2_w6_result.admitted_count;
            g_r2_w6_result.quiet_drop_count =
                g_r2_w6_result.capacity_drop_count;
            g_r2_w6_result.quiet_processed_count =
                g_r2_w6_result.processed_count;

            if ((irq_before != g_r2_w6_result.irq_count) ||
                (input_before != g_r2_w6_result.input_count) ||
                (admitted_before != g_r2_w6_result.admitted_count) ||
                (drop_before != g_r2_w6_result.capacity_drop_count) ||
                (processed_before != g_r2_w6_result.processed_count))
            {
                LatchFault(R2_W6_FAULT_EVENT);
            }
        }

        if (g_r2_w6_result.fault_bits == 0U)
        {
            Finalize();
        }

        g_r2_w6_result.test_pass =
            g_r2_w6_result.fault_bits == 0U ? 1U : 0U;
        g_r2_w6_result.phase =
            g_r2_w6_result.test_pass != 0U ?
            R2_W6_COMPLETE : R2_W6_FAILED;
    }

    for (;;)
    {
        vTaskDelay(pdMS_TO_TICKS(1000U));
    }
}

void R2_W6_CreateTasks(void)
{
    TaskHandle_t control_handle;
    uint32_t id;

    g_r2_w6_result.magic = W6_MAGIC;
    g_r2_w6_result.configured_k = R2_W6_K;
    g_r2_w6_result.drop_mode = R2_W6_DROP_MODE;
    g_r2_w6_result.process_hold_blocks = R2_W6_PROCESS_HOLD_BLOCKS;
    g_r2_w6_result.start_status = UINT32_MAX;
    g_r2_w6_result.stop_status = UINT32_MAX;
    g_r2_w6_result.phase = R2_W6_RESET;

    free_queue = xQueueCreateStatic(
        R2_W6_K,
        sizeof(R2_BufferId),
        free_queue_storage,
        &free_queue_control);

    ready_queue = xQueueCreateStatic(
        R2_W6_K,
        sizeof(W6_BlockDescriptor),
        ready_queue_storage,
        &ready_queue_control);

    if ((free_queue == NULL) || (ready_queue == NULL))
    {
        g_r2_w6_result.fault_bits = R2_W6_FAULT_CONFIG;
        g_r2_w6_result.phase = R2_W6_FAILED;
        return;
    }

    vQueueAddToRegistry(free_queue, "R2Free");
    vQueueAddToRegistry(ready_queue, "R2Ready");

    R2_BufferPool_Reset();
    R2_DmaSlots_Reset();

    if ((R2_BufferPool_Activate(R2_W6_K) != R2_BUFFER_POOL_OK) ||
        (R2_DmaSlots_Initialize((R2_BufferId)0U,
            (R2_BufferId)1U) != R2_DMA_SLOTS_OK))
    {
        g_r2_w6_result.fault_bits = R2_W6_FAULT_CONFIG;
        g_r2_w6_result.phase = R2_W6_FAILED;
        return;
    }

    free_token_mask = 0U;
    ready_token_mask = 0U;
    free_send_context.active = 0U;
    free_send_context.source = W6_FREE_SEND_NONE;
    free_send_context.buffer_id = R2_BUFFER_POOL_INVALID_ID;

    for (id = 2U; id < R2_W6_BUFFERS; ++id)
    {
        if (SendFreeToken(W6_FREE_SEND_INIT, (R2_BufferId)id, 0U) != pdPASS)
        {
            g_r2_w6_result.phase = R2_W6_FAILED;
            return;
        }
    }

    if ((uxQueueMessagesWaiting(free_queue) != R2_W6_K) ||
        (free_token_mask != (W6_ALL_BUFFER_MASK & ~0x3UL)))
    {
        g_r2_w6_result.fault_bits |= R2_W6_FAULT_TOKEN_LEDGER;
        g_r2_w6_result.phase = R2_W6_FAILED;
        return;
    }

    processing_task_handle = xTaskCreateStatic(
        ProcessingTask,
        "R2W6Proc",
        W6_PROCESS_STACK_WORDS,
        NULL,
        tskIDLE_PRIORITY + 3U,
        processing_task_stack,
        &processing_task_control);

    control_handle = xTaskCreateStatic(
        ControlTask,
        "R2W6Ctl",
        W6_CONTROL_STACK_WORDS,
        NULL,
        tskIDLE_PRIORITY + 2U,
        control_task_stack,
        &control_task_control);

    g_r2_w6_result.processing_task_created =
        processing_task_handle != NULL ? 1U : 0U;
    g_r2_w6_result.control_task_created =
        control_handle != NULL ? 1U : 0U;

    if ((processing_task_handle == NULL) || (control_handle == NULL))
    {
        g_r2_w6_result.fault_bits |= R2_W6_FAULT_START;
        g_r2_w6_result.phase = R2_W6_FAILED;
        return;
    }

    g_r2_w6_result.phase = R2_W6_TASKS_CREATED;
}
